export interface Hospital {
  id: number;
  name: string;
  address: string;
  phone: string;
  lat: number;
  lng: number;
}

export const hospitals: Hospital[] = [
  {
    id: 1,
    name: "Γ.Ν.Α. «ΛΑΪΚΟ»",
    address: "Αγ. Θωμά 17, Τ.Κ.:11527, Αθήνα",
    phone: "1566",
    lat: 37.9836,
    lng: 23.7668,
  },
  {
    id: 2,
    name: "Γ.Ν.Α. «Ο ΕΥΑΓΓΕΛΙΣΜΟΣ»",
    address: "Υψηλάντου 45-47, Τ.Κ.:10676, Αθήνα",
    phone: "2132045167",
    lat: 37.976,
    lng: 23.748,
  },
  {
    id: 3,
    name: "Γ.Ν.Α. «Γ.ΓΕΝΝΗΜΑΤΑΣ»",
    address: "Λεωφόρος Μεσογείων 154, Τ.Κ.:11527, Αθήνα",
    phone: "2132034150",
    lat: 37.989,
    lng: 23.778,
  },
  {
    id: 4,
    name: "Γ.Ν.Ν.Θ.Α. «Η ΣΩΤΗΡΙΑ»",
    address: "Λεωφόρος Μεσογείων 152, Τ.Κ.:11527, Αθήνα",
    phone: "2107763620",
    lat: 37.9885,
    lng: 23.7775,
  },
  {
    id: 5,
    name: "Π.Γ.Ν. «ΑΤΤΙΚΟΝ»",
    address: "Ρίμινι 1, Τ.Κ.: 124 62, Χαϊδάρι",
    phone: "2105832030",
    lat: 38.015,
    lng: 23.633,
  },
  {
    id: 6,
    name: "Π.Γ.Ν.Θ. «ΑΧΕΠΑ»",
    address: "Στ. Κυριακίδη 1, Τ.Κ.: 54636, Θεσσαλονίκη",
    phone: "14970",
    lat: 40.63,
    lng: 22.956,
  },
  {
    id: 7,
    name: "Γ.Ν.Θ. «ΙΠΠΟΚΡΑΤΕΙΟ»",
    address: "Κωνσταντινουπόλεως 49, Τ.Κ.: 546 42, Θεσσαλονίκη",
    phone: "2310892500",
    lat: 40.613,
    lng: 22.96,
  },
  {
    id: 8,
    name: "Γ.Ν.Θ. «Γ.ΠΑΠΑΝΙΚΟΛΑΟΥ»",
    address: "Λεωφόρος Παπανικολάου 60, Εξοχή Θεσσαλονίκης",
    phone: "14970",
    lat: 40.672,
    lng: 23.013,
  },
  {
    id: 9,
    name: "Π.Γ.Ν. ΑΛΕΞΑΝΔΡΟΥΠΟΛΗΣ",
    address: "Δραγάνα Αλεξανδρούπολης Τ.Κ.: 68100",
    phone: "2551352465",
    lat: 40.844,
    lng: 25.836,
  },
  {
    id: 10,
    name: "Π.Γ.Ν. ΛΑΡΙΣΑΣ",
    address: "Μεζούρλο, Τ.Κ.: 41110, Λάρισα",
    phone: "2413502436",
    lat: 39.619,
    lng: 22.396,
  },
  {
    id: 11,
    name: "Π.Γ.Ν.Π «ΠΑΝΑΓΙΑ Η ΒΟΗΘΕΙΑ»",
    address: "Ρίο Πατρών Τ.Κ.: 26504, Πάτρα",
    phone: "2611-100281",
    lat: 38.293,
    lng: 21.796,
  },
  {
    id: 12,
    name: "Π.Γ.Ν. ΙΩΑΝΝΙΝΩΝ",
    address: "Λεωφόρος Σταύρου Νιάρχου, 45500, Ιωάννινα",
    phone: "26510-99500",
    lat: 39.616,
    lng: 20.835,
  },
  {
    id: 13,
    name: "Π.Γ.Ν. ΗΡΑΚΛΕΙΟΥ",
    address: "Βούτες Ηρακλείου Κρήτης Τ.Κ.: 71500",
    phone: "2810542107",
    lat: 35.305,
    lng: 25.101,
  },
  {
    id: 14,
    name: "Γ.Ν. ΡΟΔΟΥ «ΑΝΔΡΕΑΣ ΠΑΠΑΝΔΡΕΟΥ»",
    address: "Κριστιάν Μπαρνάρντ 1, Τ.Κ.: 85133, Ρόδος",
    phone: "2241360000",
    lat: 36.417,
    lng: 28.196,
  },
];
